package by.ad.les03.main;
/*
 * 2. Составить программу сравнения двух чисел 1 и 2. 
 * Если 1 меньше 2 – вывести на экран слово «yes», в противном случае – слово «no» 
 */

public class Task02 {

	public static void main(String[] args) {
		double a;
		double b;
		a=5;
		b=11;
		
		
		if (a<b) {
			System.out.println("yes");
		} else
		{System.out.println("no");}

	}

}
