package by.ad.les03.main;
/*
 * 20. Определить, делителем каких чисел а, b, с является число k. 
 */
public class Task20 {

	public static void main(String[] args) {
		int a;
		int b;
		int c;
		int k;
		
		k=5;
		a=25;
		b=15;
		c=5;
		
		if (a%k==0) {
			System.out.println("Число к является делителем числа а");
		} 
		if (b%k==0) {
			System.out.println("Число к является делителем числа b");
		} 
		if (c%k==0) {
			System.out.println("Число к является делителем числа c");
		}
		
		
		
		
		
	}

}
